# =============================================================================
# Brewfile - Homebrew Dependencies
# =============================================================================
# Install all packages with: brew bundle --file=Brewfile
# =============================================================================

# =============================================================================
# CORE TOOLS
# =============================================================================

brew "stow"                 # Dotfiles management
brew "neovim"               # Text editor
brew "git"                  # Version control

# =============================================================================
# MODERN CLI TOOLS
# =============================================================================

brew "fzf"                  # Fuzzy finder
brew "bat"                  # Better cat with syntax highlighting
brew "eza"                  # Modern ls replacement
brew "tree"                 # Directory visualization
brew "fd"                   # Better find
brew "ripgrep"              # Better grep
brew "zoxide"               # Smart directory jumping
brew "atuin"                # Searchable shell history
brew "direnv"               # Directory-specific environments
brew "starship"             # Modern prompt
brew "zsh-autosuggestions"  # Command suggestions

# =============================================================================
# GIT TOOLS
# =============================================================================

brew "lazygit"              # Terminal UI for git
brew "gh"                   # GitHub CLI

# =============================================================================
# DEVELOPMENT TOOLS
# =============================================================================

brew "go"                   # Go programming language
brew "gopls"                # Go language server
brew "golangci-lint"        # Go linter
brew "nvm"                  # Node version manager
brew "pyenv"                # Python version manager
brew "pyenv-virtualenv"     # Pyenv virtualenv plugin

# =============================================================================
# TERMINAL
# =============================================================================

# Ghostty is installed separately:
# Download from: https://ghostty.org
# Or: brew install --cask ghostty (if available)

# =============================================================================
# OPTIONAL TOOLS
# =============================================================================

# Uncomment if needed:
# brew "tmux"                # Terminal multiplexer
# brew "jq"                  # JSON processor
# brew "htop"                # Better top
# brew "tldr"                # Simplified man pages
# brew "wget"                # File downloader
